tutorials/viscoelastic/viscoelasticFluidFoam/UCM/constant/viscoelasticProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      viscoelasticProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

/*

From:
Fernandes, C., De Araujo, M.S.B., Ferrás, L.L., Nóbrega, J.M.,
Improvements in the OpenFOAM numerical code for simulation of 
steady-state differential viscoelastic flows, 11th OpenFOAM Workshop
Guimarães, Portugal, June 26 - 30, 2016

and 

De Araujo, M.S.B., Ferras, L.L.,Fernandes, C.,Nobrega, J.M.,
Improvements ans assessment of the integral viscoelastic solver in OpenFOAM, 11th OpenFOAM Workshop
Guimarães, Portugal, June 26 - 30, 2016

*/


rheology
{
                type 		 	 UCM;
                rho              rho [1 -3 0 0 0 0 0] 100;
                etaP             etaP [1 -1 -1 0 0 0 0] 0.25;
                lambda           lambda [0 0 1 0 0 0 0] 1;
                etaStab          0.25; 
}

// ************************************************************************* //
